In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv("D:\Vinayak\Data Science\DS Fusion Tech\Stats\Stats-Case Study Excercise\dietstudy.csv")

In [3]:
df1.head()

   patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0      1   45    Male  180  148  106  113  100   198   196   193   188   192
1      2   56    Male  139   94  119   75   92   237   233   232   228   225
2      3   50    Male  152  185   86  149  118   233   231   229   228   226
3      4   46  Female  112  145  136  149   82   179   181   177   174   172
4      5   64    Male  156  104  157   79   97   219   217   215   213   214

In [4]:
import scipy.stats as stats

1. A physician is evaluating a new diet for her patients with a family history of heart disease. To test the effectiveness of this diet, 16 patients are placed on the diet for 6 months. Their weights and triglyceride levels are measured before and after the study, and the physician wants to know if either set of measurements has changed. (Data set: dietstudy.csv)

In [5]:
stats.ttest_rel(df1['tg0'],df1['tg4'])

Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

In [6]:
0.24874946576903698/2*100

12.437473288451848

In [7]:
# Since Pvalue is > 5%, there is no change in the triglyceride level.

In [8]:
stats.ttest_rel(df1['wgt0'],df1['wgt4'])

Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

In [9]:
1.137689414996614e-08*100

1.137689414996614e-06

In [10]:
# Since Pvalue is < 5%, there is some improvement in the weight of patients.

2. An analyst at a department store wants to evaluate a recent credit card promotion. To this end, 500 cardholders were randomly selected. Half received an ad promoting a reduced interest rate on purchases made over the next three months, and half received a standard seasonal ad. Is the promotion effective to increase sales? (Data set: creditpromo.csv)

In [11]:
df2=pd.read_csv("D:\Vinayak\Data Science\DS Fusion Tech\Stats\Stats-Case Study Excercise\creditpromo.csv")

In [12]:
df2.head()

     id         insert      dollars
0   148       Standard  2232.771979
1   572  New Promotion  1403.807542
2   973       Standard  2327.092181
3  1096       Standard  1280.030541
4  1541  New Promotion  1513.563200

In [13]:
Standard = df2[df2['insert']== 'Standard']['dollars']

In [14]:
Standard

0      2232.771979
2      2327.092181
3      1280.030541
7      1476.624884
8      1460.769753
          ...
490    1336.515307
493    1330.233179
497    1919.856304
498    1863.014814
499    1295.012183
Name: dollars, Length: 250, dtype: float64

In [15]:
New_Promo = df2[df2['insert']== 'New Promotion']['dollars']

In [16]:
New_Promo

1      1403.807542
4      1513.563200
5      1729.627996
6      1609.705918
9      1854.489028
          ...
491    2227.464385
492    2007.541756
494    2000.050800
495    1513.060134
496    1020.757943
Name: dollars, Length: 250, dtype: float64

In [17]:
stats.ttest_ind(Standard,New_Promo)

Ttest_indResult(statistic=-2.2604227264649963, pvalue=0.024225996894147814)

In [18]:
0.024225996894147814/2*100

1.2112998447073908

In [19]:
# Since Pvalue is < 5%, the promotion was effective to increase sales

3. An experiment is conducted to study the hybrid seed production of bottle gourd under open field conditions. The main aim of the investigation is to compare natural pollination and hand pollination. The data are collected on 10 randomly selected plants from each of natural pollination and hand pollination. The data are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm). (Data set: pollination.csv) 

 a. Is the overall population of Seed yield/plant (g) equals to 200? 
 b. Test whether the natural pollination and hand pollination under open field conditions are equally effective or are  significantly different.

In [20]:
df3=pd.read_csv("D:\Vinayak\Data Science\DS Fusion Tech\Stats\Stats-Case Study Excercise\pollination.csv")

In [21]:
df3

      Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0   Natural      1.85            147.70            16.86
1   Natural      1.86            136.86            16.77
2   Natural      1.83            149.97            16.35
3   Natural      1.89            172.33            18.26
4   Natural      1.80            144.46            17.90
5   Natural      1.88            138.30            16.95
6   Natural      1.89            150.58            18.15
7   Natural      1.79            140.99            18.86
8   Natural      1.85            140.57            18.39
9   Natural      1.84            138.33            18.58
10     Hand      2.58            224.26            18.18
11     Hand      2.74            197.50            18.07
12     Hand      2.58            230.34            19.07
13     Hand      2.62            217.05            19.00
14     Hand      2.68            233.84            18.00
15     Hand      2.56            216.52            18.49
16     Hand      2.34            211.93            17.45
17     Hand      2.67            210.37            18.97
18     Hand      2.45            199.87            19.31
19     Hand      2.44            214.30            19.36

In [22]:
stats.ttest_1samp(df3['Seed_Yield_Plant'],200)

Ttest_1sampResult(statistic=-2.3009121248548645, pvalue=0.032891040921283025)

In [23]:
0.032891040921283025/2*100

1.6445520460641512

In [24]:
# Since Pvalue is < 5%, the overall population of Seed yield/plant (g) is less then 200

In [25]:
Hand_Pol = df3[df3['Group']=='Hand']

In [26]:
Hand_Pol

   Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
10  Hand      2.58            224.26            18.18
11  Hand      2.74            197.50            18.07
12  Hand      2.58            230.34            19.07
13  Hand      2.62            217.05            19.00
14  Hand      2.68            233.84            18.00
15  Hand      2.56            216.52            18.49
16  Hand      2.34            211.93            17.45
17  Hand      2.67            210.37            18.97
18  Hand      2.45            199.87            19.31
19  Hand      2.44            214.30            19.36

In [27]:
Natural_Pol = df3[df3['Group']=='Natural']

In [28]:
Natural_Pol

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90
5  Natural      1.88            138.30            16.95
6  Natural      1.89            150.58            18.15
7  Natural      1.79            140.99            18.86
8  Natural      1.85            140.57            18.39
9  Natural      1.84            138.33            18.58

In [29]:
stats.ttest_ind(Hand_Pol['Fruit_Wt'],Natural_Pol['Fruit_Wt'])

Ttest_indResult(statistic=17.669989614440286, pvalue=8.078362076486221e-13)

In [30]:
stats.ttest_ind(Hand_Pol['Seed_Yield_Plant'],Natural_Pol['Seed_Yield_Plant'])

Ttest_indResult(statistic=13.958260515902547, pvalue=4.2714815854843853e-11)

In [31]:
stats.ttest_ind(Hand_Pol['Seedling_length'],Natural_Pol['Seedling_length'])

Ttest_indResult(statistic=2.542229999657055, pvalue=0.020428817064110226)

In [32]:
# Since all individual Pvalues are < 5%, the hand pollination under open field conditions are more effective.

4. An electronics firm is developing a new DVD player in response to customer requests. Using a prototype, the marketing team has collected focus data for different age groups viz. Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above. Do you think that consumers of various ages rated the design differently? (Data set: dvdplayer.csv).

In [33]:
df4=pd.read_csv("D:\Vinayak\Data Science\DS Fusion Tech\Stats\Stats-Case Study Excercise\dvdplayer.csv")

In [34]:
df4.sample(20)

       agegroup   dvdscore
2   65 and over  31.704307
50     Under 25  26.445446
14        55-64  32.608214
43        55-64  29.145163
46        35-44  40.286794
56        35-44  41.773643
24        35-44  28.382727
47        35-44  33.345991
66  65 and over  33.538502
17        45-54  33.427606
39  65 and over  24.910108
6   65 and over  29.677695
38        45-54  42.499906
34     Under 25  30.682770
3   65 and over  25.924460
48     Under 25  22.448363
0   65 and over  38.454803
53  65 and over  24.484316
27  65 and over  27.837498
12     Under 25  40.469488

In [35]:
age65_and_over = df4[df4['agegroup']=='65 and over']['dvdscore']

In [36]:
age65_and_over.head()

0    38.454803
2    31.704307
3    25.924460
6    29.677695
8    23.509700
Name: dvdscore, dtype: float64

In [37]:
ageUnder_25 = df4[df4['agegroup']=='Under 25']['dvdscore']

In [38]:
age55_to_64 = df4[df4['agegroup']=='55-64']['dvdscore']

In [39]:
age35_to_44 = df4[df4['agegroup']=='35-44']['dvdscore']

In [40]:
age25_to_34 = df4[df4['agegroup']=='25-34']['dvdscore']

In [41]:
age45_to_54 = df4[df4['agegroup']=='45-54']['dvdscore']

In [42]:
stats.f_oneway(ageUnder_25,age25_to_34,age35_to_44,age45_to_54,age55_to_64,age65_and_over)

F_onewayResult(statistic=6.992526962676518, pvalue=3.087324905679639e-05)

In [43]:
3.087324905679639e-05/2*100

0.0015436624528398194

In [44]:
# Since all Pvalues are < 5%, we conclude that consumers of various ages rated the design differently

5. A survey was conducted among 2800 customers on several demographic characteristics. Working status, sex, age, age-group, race, happiness, no. of child, marital status, educational qualifications, income group etc. had been captured for that purpose. (Data set: sample_survey.csv). 
a. Is there any relationship in between labour force status with marital status? 
b. Do you think educational qualification is somehow controlling the marital status? 
c. Is happiness is driven by earnings or marital status?

In [45]:
df5=pd.read_csv("D:\Vinayak\Data Science\DS Fusion Tech\Stats\Stats-Case Study Excercise\sample_survey.csv")

In [60]:
df5

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2827,2828,Working full time,Married,2.0,73.0,14.0,8.0,12.0,12.0,Junior college,...,65 or older,1-2,No,No,No,No,No,American,American,German
2828,2829,Working full time,Divorced,0.0,40.0,12.0,12.0,12.0,NaN,High school,...,35 to 44,None,No,No,No,No,No,Japanese,NaN,NaN
2829,2830,Retired,Married,0.0,73.0,6.0,4.0,NaN,10.0,LT High school,...,65 or older,None,Yes,No,Yes,No,No,Korean,American,American
2830,2831,Working full time,Never married,0.0,47.0,12.0,12.0,12.0,NaN,High school,...,45 to 54,None,No,No,No,No,No,Japanese,NaN,NaN
2831,2832,Working part-time,Never married,0.0,20.0,10.0,NaN,NaN,NaN,LT High school,...,Less than 25,None,No,No,No,No,No,Swedish,American,German

In [53]:
v=pd.crosstab(df5['wrkstat'],df5['marital'],margins=True)

In [54]:
v

marital,Divorced,Married,Never married,Separated,Widowed,All
wrkstat,,,,,,
Keeping house,25,200,35,13,55,328
Other,12,16,14,4,8,54
Retired,53,168,17,6,150,394
School,7,9,60,2,1,79
Temporarily not working,9,23,11,1,2,46
"Unemployed, laid off",10,13,32,0,3,58
Working full time,295,778,392,58,44,1567
Working part-time,35,138,102,9,20,304
All,446,1345,663,93,283,2830

In [55]:
stats.chi2_contingency(observed=v)

(729.2421426572284,
 1.820339965538765e-127,
 40,
 array([[5.16918728e+01, 1.55886926e+02, 7.68424028e+01, 1.07787986e+01,
         3.28000000e+01, 3.28000000e+02],
        [8.51024735e+00, 2.56643110e+01, 1.26508834e+01, 1.77455830e+00,
         5.40000000e+00, 5.40000000e+01],
        [6.20932862e+01, 1.87254417e+02, 9.23045936e+01, 1.29477032e+01,
         3.94000000e+01, 3.94000000e+02],
        [1.24501767e+01, 3.75459364e+01, 1.85077739e+01, 2.59611307e+00,
         7.90000000e+00, 7.90000000e+01],
        [7.24946996e+00, 2.18621908e+01, 1.07766784e+01, 1.51166078e+00,
         4.60000000e+00, 4.60000000e+01],
        [9.14063604e+00, 2.75653710e+01, 1.35879859e+01, 1.90600707e+00,
         5.80000000e+00, 5.80000000e+01],
        [2.46954770e+02, 7.44740283e+02, 3.67109894e+02, 5.14950530e+01,
         1.56700000e+02, 1.56700000e+03],
        [4.79095406e+01, 1.44480565e+02, 7.12197880e+01, 9.99010601e+00,
         3.04000000e+01, 3.04000000e+02],
        [4.46000000e+02, 1.34500000e+03, 6.63000000e+02, 9.30000000e+01,
         2.83000000e+02, 2.83000000e+03]]))

In [ ]:
# Since P-value is < 5% , there is relation between region & Segment.

In [56]:
e=pd.crosstab(df5['degree'],df5['marital'],margins=True)

In [57]:
e

marital         Divorced  Married  Never married  Separated  Widowed   All
degree
Bachelor              58      251            129         12       28   478
Graduate              29      123             41          3        9   205
High school          241      686            367         58      148  1500
Junior college        45      108             46          3        6   208
LT High school        70      174             77         17       92   430
All                  443     1342            660         93      283  2821

In [58]:
stats.chi2_contingency(observed=e)

(122.68449020508541,
 7.424404099753273e-15,
 25,
 array([[  75.06345268,  227.39312301,  111.83268345,   15.75824176,
           47.95249911,  478.        ],
        [  32.19248493,   97.52215526,   47.9617157 ,    6.75824176,
           20.56540234,  205.        ],
        [ 235.55476781,  713.57674583,  350.9393832 ,   49.45054945,
          150.4785537 , 1500.        ],
        [  32.66359447,   98.94930876,   48.66359447,    6.85714286,
           20.86635945,  208.        ],
        [  67.52570011,  204.55866714,  100.60262318,   14.17582418,
           43.1371854 ,  430.        ],
        [ 443.        , 1342.        ,  660.        ,   93.        ,
          283.        , 2821.        ]]))

In [ ]:
 # Since P-value is < 5% , we conclude that educational qualification is somehow controlling the marital status

In [73]:
df5[['happy','income','marital']]

              happy          income        marital
0      Pretty happy  $25000 or more       Divorced
1      Pretty happy  $15000 - 19999  Never married
2        Very happy  $25000 or more        Married
3        Very happy  $15000 - 19999  Never married
4      Pretty happy  $25000 or more  Never married
...             ...             ...            ...
2827     Very happy  $20000 - 24999        Married
2828  Not too happy  $15000 - 19999       Divorced
2829   Pretty happy  $20000 - 24999        Married
2830   Pretty happy  $25000 or more  Never married
2831   Pretty happy  $25000 or more  Never married

[2832 rows x 3 columns]

In [70]:
df5.columns

Index(['id', 'wrkstat', 'marital', 'childs', 'age', 'educ', 'paeduc', 'maeduc',
       'speduc', 'degree', 'sex', 'race', 'born', 'parborn', 'granborn',
       'income', 'rincome', 'polviews', 'cappun', 'postlife', 'happy',
       'hapmar', 'owngun', 'news', 'tvhours', 'howpaid', 'ethnic', 'eth1',
       'eth2', 'eth3', 'confinan', 'conbus', 'coneduc', 'conpress', 'conmedic',
       'contv', 'agecat', 'childcat', 'news1', 'news2', 'news3', 'news4',
       'news5', 'car1', 'car2', 'car3'],
      dtype='object')

In [74]:
i=pd.crosstab(df5['happy'],df5['income'],margins=True)

In [75]:
i

income,$1000 TO 2999,$10000 - 14999,$15000 - 19999,$20000 - 24999,$25000 or more,$3000 TO 3999,$4000 TO 4999,$5000 TO 5999,$6000 TO 6999,$7000 TO 7999,$8000 TO 9999,LT $1000,All
happy,,,,,,,,,,,,,
Not too happy,7,39,33,40,113,9,9,6,14,12,9,11,302
Pretty happy,20,107,119,155,888,11,13,18,13,21,30,13,1408
Very happy,5,44,26,50,571,4,10,11,6,14,19,11,771
All,32,190,178,245,1572,24,32,35,33,47,58,35,2481

In [76]:
stats.chi2_contingency(observed=i)

(178.95053061216427,
 7.234749067043371e-21,
 36,
 array([[   3.89520355,   23.12777106,   21.66706973,   29.82265216,
          191.35187424,    2.92140266,    3.89520355,    4.26037888,
            4.01692866,    5.72108021,    7.06005643,    4.26037888,
          302.        ],
        [  18.16041919,  107.82748892,  101.01733172,  139.04070939,
          892.1305925 ,   13.62031439,   18.16041919,   19.86295848,
           18.72793229,   26.67311568,   32.91575977,   19.86295848,
         1408.        ],
        [   9.94437727,   59.04474002,   55.31559855,   76.13663845,
          488.51753325,    7.45828295,    9.94437727,   10.87666264,
           10.25513906,   14.60580411,   18.0241838 ,   10.87666264,
          771.        ],
        [  32.        ,  190.        ,  178.        ,  245.        ,
         1572.        ,   24.        ,   32.        ,   35.        ,
           33.        ,   47.        ,   58.        ,   35.        ,
         2481.        ]]))

In [ ]:
# Since P-value is less then 5%, we conclude that earnings has some effects on happiness.

In [77]:
m=pd.crosstab(df5['happy'],df5['marital'],margins=True)

In [78]:
m

marital        Divorced  Married  Never married  Separated  Widowed   All
happy
Not too happy        72       71            108         30       59   340
Pretty happy        278      684            426         49      137  1574
Very happy           93      582            120         13       83   891
All                 443     1337            654         92      279  2805

In [79]:
stats.chi2_contingency(observed=m)

(260.68943894182826,
 7.762777322980048e-47,
 15,
 array([[  53.6969697 ,  162.06060606,   79.27272727,   11.15151515,
           33.81818182,  340.        ],
        [ 248.58538324,  750.24527629,  366.98609626,   51.62495544,
          156.55828877, 1574.        ],
        [ 140.71764706,  424.69411765,  207.74117647,   29.22352941,
           88.62352941,  891.        ],
        [ 443.        , 1337.        ,  654.        ,   92.        ,
          279.        , 2805.        ]]))

In [ ]:
# Since P-value is less then 5%, we conclude that happiness is driven more by marital status.